InformationRegisters/Renault_ПользователиИШаблоныПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПользователиИШаблоныПравИНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваИНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПраваИНастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_НормализованныеКонтактыДляПоиска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_НормализованныеКонтактыДляПоиска</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ТипыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РозничныйКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныйКлиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ОбращениеКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ОбращениеКлиента</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Comment>Тип обращения клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашеОбращениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашеОбращениеПричина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПодТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяЗаявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОбращениеКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПодробностиОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОщущениеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ОщущенияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланиеКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПожеланияКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Риск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Риски</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяСистемаАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемныеСистемыАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПроблемыКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ДетализацииПроблемКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерПроблемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ХарактерыПроблемПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектацияАвто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьРешения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроисхождениеОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроисхожденияОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытияОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПричиныЗакрытияОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаПослеПродажногоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ПроблемыПослеПродажногоОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ПрохождениеТО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДопОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатныеРемонты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовтороноеПриобретенияАвтоRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажиАвто</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СостоянияАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбращенияВДЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РепутационныеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическиеРиски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗКП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ЗапросНаКоммерческуюПомощь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияПоОбращению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ДействияПоОбращениям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПланируемая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнениеПросрочено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаВыполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбращение</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияОбщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСообщения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/DMS_ОбращенияКлиентов/Ext/Module.bsl
//Регламентное задание "Рассылка оповещений" 
// выполняет отправку  различных оповещений по работе с обращениями клиентов
Процедура РассылкаОповещений(Параметр1 = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	dms_ЖурналСобытий.Подсистема,
	|	dms_ЖурналСобытий.Событие,
	|	dms_ЖурналСобытий.СпособОповещения,
	|	dms_ЖурналСобытий.РегистраторСобытия,
	|	dms_ЖурналСобытий.НомерСобытия,
	|	dms_ЖурналСобытий.ДатаОповещения КАК ДатаОповещения,
	|	dms_ЖурналСобытий.ДатаИсполнения,
	|	dms_ЖурналСобытий.ОбъектОповещения,
	|	dms_ЖурналСобытий.ТекстОповещения,
	|	dms_ЖурналСобытий.Приоритет
	|ИЗ
	|	РегистрСведений.dms_ЖурналСобытий КАК dms_ЖурналСобытий
	|ГДЕ
	|	dms_ЖурналСобытий.Подсистема = ЗНАЧЕНИЕ(Справочник.DMS_Подсистемы.ОбращенияКлиентов)
	|	И dms_ЖурналСобытий.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И dms_ЖурналСобытий.ДатаОповещения <= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УспешноОбработано = Ложь;
		
		Если ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.Сотрудники")
			и ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.Контрагенты") 
			и ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.CRM_ПотенциальныеКонтрагенты")
			и ТипЗнч(Выборка.ОбъектОповещения) <> Тип("СправочникСсылка.CRM_Отделы") тогда
			// пропускаем оповещения с некорректным типом объекта оповещения.
			Продолжить;
		КонецЕсли;
		
		Если Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.Напоминание Тогда
			// формируем напоминание, только для сотрудников
			Если ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.Сотрудники")
				или ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.CRM_Отделы") тогда 	
				Напоминание = Справочники.Renault_СообщенияПользователю.СоздатьЭлемент();
				Напоминание.Отправитель = "Система";
				Если ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.CRM_Отделы") тогда 	
					СписокСотрудниковОтдела = ПолучитьСписокСотрудниковОтдела(Выборка.ОбъектОповещения);
					Для каждого Стр из СписокСотрудниковОтдела цикл
						Напоминание.Адресаты.Добавить().Сотрудник = Стр.Сотрудник;
					КонецЦикла;
				Иначе
					Напоминание.Адресаты.Добавить().Сотрудник = Выборка.ОбъектОповещения;
				КонецЕсли;

				Напоминание.ДатаОтправки = ТекущаяДата();
				Напоминание.Комментарий = "";
				Напоминание.ВидСообщения = Справочники.Renault_ВидСообщения.ДействиеПоОбращению;
				Напоминание.ПоказыватьС = Выборка.ДатаОповещения;
				Напоминание.ПоказыватьПо = Выборка.ДатаОповещения+900;
				Напоминание.Наименование = "Действия по обращениям";
				Напоминание.Сообщение = Выборка.ТекстОповещения;
				Напоминание.ИдентификаторОбъекта = Строка(Выборка.РегистраторСобытия.УникальныйИдентификатор());
				Напоминание.Записать();
				УспешноОбработано = Истина;
			КонецЕсли;
			
		ИначеЕсли Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.ПоСМС 
			или Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.ПоПочте Тогда
			// формируем отправку письма или СМС
			
			ТаблицаСообщений = Новый ТаблицаЗначений;
			ТаблицаСообщений.Колонки.Добавить("Получатели");
			ТаблицаСообщений.Колонки.Добавить("ТекстСообщения");
			ТаблицаСообщений.Колонки.Добавить("BIR");
			
			
			НоваяСтрока = ТаблицаСообщений.Добавить();
			НоваяСтрока.BIR = "99999999";//"64306105";
			НоваяСтрока.ТекстСообщения = Выборка.ТекстОповещения;
			
			Получатели = Новый ТаблицаЗначений;
			Если Выборка.СпособОповещения = Справочники.DMS_СпособыОповещения.ПоСМС тогда
				Получатели.Колонки.Добавить("Телефон");
				СтрокаПолучатель = Получатели.Добавить();
				СтрокаПолучатель.Телефон =  ПолучитьТелефонОбъекта(Выборка.ОбъектОповещения);
				НоваяСтрока.Получатели = Получатели;
				DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуСМС(ТаблицаСообщений);
			иначе
				Получатели.Колонки.Добавить("Адрес");
				
				Если ТипЗнч(Выборка.ОбъектОповещения) = Тип("СправочникСсылка.CRM_Отделы") тогда
					СписокСотрудниковОтдела = ПолучитьСписокСотрудниковОтдела(Выборка.ОбъектОповещения);
					Для каждого Стр из СписокСотрудниковОтдела цикл
						СтрокаПолучатели = Получатели.Добавить();
						СтрокаПолучатели.Адрес = ПолучитьПочтуОбъекта(Стр.Сотрудник);
					КонецЦикла;
				Иначе
					СтрокаПолучатели = Получатели.Добавить();
					СтрокаПолучатели.Адрес = ПолучитьПочтуОбъекта(Выборка.ОбъектОповещения);
				КонецЕсли;
				
				НоваяСтрока.Получатели = Получатели;
				DMS_ВзаимодействияСКлиентом.ВыполнитьРассылкуПисем(ТаблицаСообщений);
				
			КонецЕсли;
			
			УспешноОбработано = Истина;
		Иначе
			// прочие виды оповещений пока не обрабатываем.
		КонецЕсли;
		
		
		Если УспешноОбработано тогда
			
			Подсистема_ОбащенияКлиентов = Справочники.DMS_Подсистемы.ОбращенияКлиентов;
			Набор = РегистрыСведений.dms_ЖурналСобытий.СоздатьНаборЗаписей();
			Набор.Отбор.Подсистема.Установить(Подсистема_ОбащенияКлиентов);
			Набор.Отбор.Событие.Установить(Выборка.Событие);
			Набор.Отбор.СпособОповещения.Установить(Выборка.СпособОповещения);
			Набор.Отбор.РегистраторСобытия.Установить(Выборка.РегистраторСобытия);
			Набор.Отбор.НомерСобытия.Установить(Выборка.НомерСобытия);
			
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,Выборка);
			Запись.ДатаИсполнения = ТекущаяДата();
			Набор.Записать(Истина);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокСотрудниковОтдела(Отдел)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПользователиИШаблоныПравИНастроек.Пользователь.Сотрудник КАК Сотрудник
		|ИЗ
		|	Справочник.Renault_ПраваИНастройкиПользователей КАК Renault_ПраваИНастройкиПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ПользователиИШаблоныПравИНастроек КАК Renault_ПользователиИШаблоныПравИНастроек
		|		ПО Renault_ПользователиИШаблоныПравИНастроек.ПраваИНастройки = Renault_ПраваИНастройкиПользователей.Ссылка
		|ГДЕ
		|	Renault_ПраваИНастройкиПользователей.Отдел = &Отдел
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("Отдел", Отдел);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьНомерСобытия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(dms_ЖурналСобытий.НомерСобытия, 1)) КАК НомерСобытия
	|ИЗ
	|	РегистрСведений.dms_ЖурналСобытий КАК dms_ЖурналСобытий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСобытия УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		
		Если Выборка.НомерСобытия = Null тогда
			Возврат 1;
		Иначе
			Возврат Выборка.НомерСобытия+1;	
		КонецЕсли;
	иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонОбъекта(Объект) Экспорт 
	
	Телефон = Renault_CRM.ПолучитьТелефонКлиент(Объект);
	Телефон = Стрзаменить(Телефон,"(","");
	Телефон = Стрзаменить(Телефон,")","");
	Телефон = Стрзаменить(Телефон," ","");
	Телефон = Стрзаменить(Телефон,".","");
	Телефон = Стрзаменить(Телефон,",","");
	Возврат Телефон;
	
КонецФункции

Функция ВернутьТекущегоСотрудника() экспорт
	
	Возврат Справочники.Пользователи.НайтиПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя).Сотрудник;
	
КонецФункции


Функция ПолучитьПочтуОбъекта(Объект) Экспорт 
	
	Возврат Renault_CRM.ПолучитьЕмаилКлиент(Объект);
	
КонецФункции

//&НаСервереБезКонтекста
Функция ПолучитьДанныеКонтрагентаНаСервере(Контрагент) Экспорт
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("EMail",Renault_CRM.ПолучитьЕмаилКлиент(Контрагент));
	СтруктураДанных.Вставить("Телефон",Renault_CRM.ПолучитьТелефонКлиент(Контрагент));
	СтруктураДанных.Вставить("Адрес",Renault_CRM.ПолучитьАдресКлиент(Контрагент));
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция Renault_ОформитьЖалобу(Клиент, Автомобиль, СуществующаяЖалоба = Неопределено, ПоказыватьДокумент = Истина, Дата = Неопределено) Экспорт

	
		Жалоба = Документы.DMS_ОбращениеКлиента.СоздатьДокумент();
		Жалоба.Контрагент = Клиент; 
		Жалоба.ТипКлиента = Перечисления.Renault_ТипыКлиентов.РозничныйКлиент; 
		Жалоба.Автомобиль = Автомобиль;
		Жалоба.КомплектацияАвто = Автомобиль.ВариантКомплектации;
		Жалоба.ПричинаОбращения = "";
		Жалоба.Дата = ТекущаяДата();
		Жалоба.ДатаОбращенияВДЦ = ?(Дата = Неопределено, '00010101', Дата);
		Жалоба.ГосНомер = Renault_АвтосервисОбщий.Renault_ПолучитьГосНомер(Автомобиль);
		Жалоба.Модель = Автомобиль.Модель;
		Жалоба.VIN = Автомобиль.VIN;
		Жалоба.EMail = Renault_CRM.ПолучитьЕмаилКлиент(Клиент);
		Жалоба.Телефон = Renault_CRM.ПолучитьТелефонКлиент(Клиент);
		Жалоба.Пробег = Renault_АвтосервисОбщий.Renault_ПолучитьПробег(Автомобиль);
		
		НоваяСтрока = Жалоба.ДействияПоОбращению.Добавить();
		НоваяСтрока.Действие = Справочники.DMS_ДействияПоОбращениям.НазначитьИсполнителя;
		НоваяСтрока.ДатаПланируемая = ТекущаяДата();
		
		Если ПоказыватьДокумент Тогда
		
		Попытка
			
			Жалоба.Записать(РежимЗаписиДокумента.Запись);
			
			#Если Клиент Тогда
				
				//pu0XXXX+
				ОткрытьЗначение(Жалоба.Ссылка);
				
				//Форма = ПолучитьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаДокументаУпр");
				//Докма = ДанныеФормыВЗначение(Форма.Объект,Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
				//ЗаполнитьЗначенияСвойств(Докма,Жалоба);
				//ЗначениеВДанныеФормы (Жалоба,Форма.Объект);
				//Форма.ОткрытьМодально();
				//
				//Жалоба = ДанныеФормыВЗначение(Форма.Объект, Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
					
			
			#КонецЕсли
			
			Возврат Жалоба.Ссылка;
			
		Исключение
			
			#Если Клиент Тогда
						
				//ПараметрыФормы = Новый Структура("Ключ", Жалоба);
				//ПараметрыФормы.Вставить("Контрагент", Клиент);
				//ПараметрыФормы.Вставить("Автомобиль", Автомобиль);
				//		
				//ОткрытьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаДокументаУпр", ПараметрыФормы);
				//
				Форма = ПолучитьФорму("Документ.DMS_ОбращениеКлиента.Форма.ФормаДокументаУпр");
				Докма = ДанныеФормыВЗначение(Форма.Объект,Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
				ЗаполнитьЗначенияСвойств(Докма,Жалоба);
				ЗначениеВДанныеФормы (Жалоба,Форма.Объект);
				Форма.ОткрытьМодально();
				
				Жалоба = ДанныеФормыВЗначение(Форма.Объект, Тип("ДокументОбъект.DMS_ОбращениеКлиента"));
								
			#КонецЕсли
			
			Если НЕ Жалоба.ЭтоНовый() тогда
				
				Возврат Жалоба.Ссылка;
				
			Иначе
				
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецПопытки;
		
	Иначе
		
		Попытка
			
			Жалоба.Записать(РежимЗаписиДокумента.Запись);
			
			Возврат Жалоба.Ссылка;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;

			
КонецФункции

Функция НайтиКонтрагентаПоТелефону(Телефон) Экспорт
	
	// Текст запроса для построения временной таблицы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_НормализованныеКонтактыДляПоиска.Объект КАК Контрагент,
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные
	               |ИЗ
	               |	РегистрСведений.Renault_НормализованныеКонтактыДляПоиска КАК Renault_НормализованныеКонтактыДляПоиска
	               |ГДЕ
	               |	Renault_НормализованныеКонтактыДляПоиска.Данные ПОДОБНО &Фрагмент";
	
	Фрагмент = Телефон;
	
	Фрагмент = СтрЗаменить(Фрагмент, "+", "");
	Фрагмент = СтрЗаменить(Фрагмент, "-", "");
	Фрагмент = СтрЗаменить(Фрагмент, ".", "");
	Фрагмент = СтрЗаменить(Фрагмент, "*", "");
	Фрагмент = СтрЗаменить(Фрагмент, " ", "");
	Фрагмент = СтрЗаменить(Фрагмент, "(", "");
	Фрагмент = СтрЗаменить(Фрагмент, ")", "");
	
	Если Найти(Фрагмент, "7") = 1 ИЛИ Найти(Фрагмент, "8") = 1 Тогда
		Фрагмент = Прав(Фрагмент, СтрДлина(Фрагмент) - 1);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Фрагмент", "%" + Фрагмент + "%");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
